#!/usr/bin/env python3
# -*- coding: utf-8 -*-

'''
string、list和tuple都属于sequence（序列）
Python 不支持单字符类型，单字符在 Python 中也是作为一个字符串使用。
'''

sString = 'abcdefghigklmn'

print(sString)  # 输出字符串
print('[0:-1] \t:', sString[0:-1])  # 输出第一个到倒数第二个的所有字符
print('[-2] \t:', sString[-2])  # 输出倒数第二个字符
print('[0] \t:', sString[0])  # 输出字符串第一个字符
print('[:2] \t:', sString[:2])  # 输出钱两个字符
print('[2:5] \t:', sString[2:5])  # 输出从第三个开始到第五个的字符
print('[2:] \t:', sString[2:])  # 输出从第三个开始的后的所有字符
print('* 2 \t:', sString * 2)  # 输出字符串两次
print('+TEST \t:', sString + "+TEST")  # 连接字符串

print(sString[0], sString[-2])

'''
转义字符
\       续行符(在行尾时)
\\	    反斜杠符号
\'	    单引号
\"	    双引号
\a	    响铃
\b	    退格(Backspace)
\e	    转义
\000	空
\n	    换行
\v	    纵向制表符
\t	    横向制表符
\r	    回车
\f	    换页
\oyy	八进制数，yy代表的字符，例如：\o12代表换行
\xyy	十六进制数，yy代表的字符，例如：\x0a代表换行
\other	其它的字符以普通格式输出
'''

'''
字符串运算符
+	    字符串连接
*	    重复输出字符串
[]	    通过索引获取字符串中字符
[ : ]	截取字符串中的一部分
in	    成员运算符 - 如果字符串中包含给定的字符返回 True
not in	成员运算符 - 如果字符串中不包含给定的字符返回 True
r/R	    原始字符串 - 原始字符串：所有的字符串都是直接按照字面的意思来使用，没有转义特殊或不能打印的字符。 原始字符串除在字符串的第一个引号前加上字母 r（可以大小写）以外，与普通字符串有着几乎完全相同的语法。	
%	格式字符串
'''

'''
字符串格式化
%c	 格式化字符及其ASCII码
%s	 格式化字符串
%d	 格式化整数
%u	 格式化无符号整型
%o	 格式化无符号八进制数
%x	 格式化无符号十六进制数
%X	 格式化无符号十六进制数（大写）
%f	 格式化浮点数字，可指定小数点后的精度
%e	 用科学计数法格式化浮点数
%E	 作用同%e，用科学计数法格式化浮点数
%g	 %f和%e的简写
%G	 %f 和 %E 的简写
%p	 用十六进制数格式化变量的地址
'''

'''
格式化操作符辅助指令
*	    定义宽度或者小数点精度
-	    用做左对齐
+	    在正数前面显示加号( + )
<sp>	在正数前面显示空格
#	    在八进制数前面显示零('0')，在十六进制前面显示'0x'或者'0X'(取决于用的是'x'还是'X')
0	    显示的数字前面填充'0'而不是默认的空格
%	    '%%'输出一个单一的'%'
(var)	映射变量(字典参数)
m.n.	m 是显示的最小总宽度,n 是小数点后的位数(如果可用的话)
'''